---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.DuctSizes
source: html/a9de8ba8-06d6-afa0-4a47-ef3e988c6646.htm
---
# DuctSizes Methods

Checks whether a duct size with the nominal diameter exists.